[
  "Good night, sleep tight. I will be dreaming of you with all my might. Love you, my wife.",
  "I thank God for creating a rare gem like you. Your love has brightened me up over the years and given me a sense of completeness. I can’t wait to spend the rest of my life with you, my lover. Good night.",
  "A day is going to end again. It is nice to have someone like you who makes every day seem so great. Thank you, my love – may all the angels guard you at night!",
  "Dear love, sending you good night messages is not how I want to express my love. I would rather be holding you tight and making up for all the lost time. Good night, my life.",
  "I would fast-forward all my days just to spend the nights beside you. Good night, sweetheart.",
  "The way you smile always makes me crazy. I could not take my eyes off you. I miss you so much. Good night, my prettiest wife!",
  "I think you’re probably asleep by now, but I want the first thing that you see in the morning to be this: I love you. Sleep tight!",
  "The stars are my mouthpiece tonight. Lookout and see how bright they are shining, a reminder of how bright our love is. Good night – I will always be by your side.",
  "I love you like roses love rain, like walking together down memory lane. Sleep tight, my lady love.",
  "Night follows day, the moon gets brighter, even the stars change their positions. Everything changes in this mutable world, but not my love for you. It was, is, and forever will be the same. Sleep well, my love.",
  "Do not sleep restless tonight. I know I am not thereby your side. But, I’m here right now just wishing you the sweetest of good nights.",
  "I hope today was as lovely as you are, and I hope you wake in the morning feeling beautiful as ever. I love you to the stars. Good night, my lady love.",
  "The sun is upset and the moon is happy because the cozy sun is missing you, and the moon is gonna be with you for the rest of the night. Have a wonderful night.",
  "I hope you sleep tight and wake up to find this wish of mine to put a smile on your pretty face for the start of a fresh day!",
  "When the sun rises, when the sun sets, you make me realize my life is the best. Good night, my loving wife.",
  "I’m so sorry that you had a bad day! I wish I was there to make you feel glad. Good night! I miss you!",
  "I hope you sleep well and wake up with a smile on your face to start a brand new day!",
  "Looking at this blissful night with romantic moonlight, a cool breeze, and glittering stars up in the sky, I can only wish to be by your side. Good night. I love you so much, my love.",
  "Tonight, I need you to know that there’s absolutely nothing in this world that I can accomplish without your love. Good night, sweet love.",
  "Good night to my wonderful wife. It was the most stressful day, but all the stresses simply disappeared after hearing your voice. You really do know how to make a tired man feel better in an instant, even if you’re far away from me. I find that the distance becomes more bearable because of all that you do for me. I love you so much, my sweetheart. You make all of this so worth it. Sweet dreams. Good night.",
  "Hello there, my beautiful wife. I just want you to know that your short visit at work is the highlight of my day. How did you know I needed to see you right at that moment? It’s like you have this sixth sense or something. You really do know me well. I guess wives who really love their husbands know when their presence is needed. Thank you for always being so attentive to my needs. This is one of the many traits that make you such a wonderful wife. I’m on my way home, sweetheart. I can’t wait to be with you. See you soon. Good night.",
  "I don’t feel so far away from you because you keep me close with your sweet messages, long phone calls, and random funny photos. Thank you for the little joys that you bring to me every single day. You may think they are just little things, but to me, they mean a lot. Your love means so much to me. You mean the world to me. I love you, sweetheart. Good night. Sweet dreams.",
  "I am the best at what I do because your love allows me to be. Being married to you is the highlight of my life. Coming home to you after a long day at work is the highlight of my day. I just cannot imagine what my life would be without you in it. Thank you for all that you do, honey. I could never ask for a better wife. Sweet dreams, my sweetheart. Good night.",
  "I will be home a little later today, so I want you to know that I haven’t stopped thinking about you. I had a ton of things to do, but all I could focus on was you. No wonder I had to stay at the office a little later because I had nothing done! Not your fault, though. It’s not your fault that I can’t stop missing and thinking about you. See you soon. Sweet dreams, my love.",
  "I just want to wish the most amazing woman in my life a very good night. You have no idea how happy you make me, and how loving you has changed my life for the better. My life is richer, happier, and more meaningful now because of you. You truly are a heaven sent. I love you, sweetheart. Sweet dreams!",
  "Every night I am reminded that you truly are my dream come true. You are my refuge. You are my peace. You are the one I most look forward coming home to at the end of the day. My heart is at peace knowing that I have you and you have me. Thank God for this miracle called love. Thank God that He gave you to me. I love you so much, my wife. Have the sweetest of dreams.",
  "Every night is a joy for me because I get to go home to someone like you. You have been nothing but amazing. Even if my days are long and stressful, I always look forward to coming home to you because you are my favorite stress reliever. I hope that all your dreams are about you and me and that you will wake up feeling reassured of my love for you. I love you, sweet wifey. Good night.",
  "Before you go to sleep, let me just send you this virtual hug and kiss. I know that it will never be as good as a real kiss from me, but this one will have to do for now.I cannot wait to see you again and hold you in my arms and kiss you until you’re breathless. It won’t be long now, love! Sweet dreams, and good night.",
  "The only consolation that I get from being away from you is knowing that you are mine and I am yours. I know that no matter the distance and no matter the time difference, our love will remain steadfast. We have overcome challenges that are much tougher than this. I know that we will easily overcome this one as well. Thank you for being so strong and optimistic. I learn to be strong and optimistic, too, because of you. I love you so much, and there’s never a moment that I don’t miss you. I love you. Sleep well, my love. Good night.",
  "The night may be long and dark, but my life with you will never ever be. You are the bright light in my life that makes everything else look radiant and beautiful. As long as I have you, I know my life will always be beautiful. As long as you love me, I know that there’s nothing that I cannot do. I love you, wifey. Have a good night’s sleep. Sweet dreams.",
  "When the lights are out and the world is asleep, I will be here thinking of you and wishing that you were with me. No need to worry, my darling. I’m alright. I’m just missing you very much, which I always am. I miss you every day and every night.Whenever I look at you, I still can’t help but think that I’m living in a dream world. You are everything that I have ever wanted, and life with you is all that I have ever prayed for. I don’t ever want this to end, my love. I love you always and forever. I hope you dream beautiful dreams tonight. Good night and sweet dreams.",
  "I always look forward to snuggling with you at night because you are just the softest, warmest, and sweetest human pillow in the world. I don’t need anything or anyone else as long as I have you. You are the only one for me, and you are the only one I will ever love. I will forever be grateful for you. Sweet dreams, my love. Good night.",
  "Nights will never be enough to satisfy my need to cuddle and snuggle with you. If I owned the world, I would cuddle and snuggle with you every second, every minute, and every hour. If I owned the world, I’d bridge the distance between us so that I wouldn’t be away from you for so long. I love you so much, my wife. Good night.",
  "I hope that the night is comfortable for you and that you are surrounded by all the things that you love. I wish that included me, but I know that you understand why your husband needs to be away. All that I’m doing right now is for you and for our future family. There are some sacrifices that must be made so that we can make our dreams come true. I promise you that this is only temporary. Thank you for being so strong about this. I love you so much. Sweetest dreams to you, my love. Good night.",
  "I’m looking at the stars tonight and wishing that I’m staring into your eyes instead. I may be in the most exotic location in the world, but I will never enjoy it fully because you are not here with me. I want to share every great experience with you. Nothing is the same as seeing something with you for the first time. I know that one day we will be together as we travel the whole world. I’m so excited for that day to come. I love you, honey. Sweet dreams.",
  "All my problems, stresses, and worries simply melt away when I think about you. I can feel the exhaustion leaving my body at the sight of you. I feel happy knowing that I get to feel your touch and your kisses again. I can’t wait to come home to you. See you later, love. Good night.",
  "Nights are a time to rest and sleep, but nights are also a time to think about you, miss you, and yearn for you. I just cannot help but do these things whenever I’m away from you. I have just gotten so used to having you next to me. As long as I’m in love with you, I know that I will never get used to having you far from me. I love you, sweetie. Good night!",
  "When night time comes, paint your night with beautiful images of you and me so that you will have the most wonderful dreams. There are so many things that I wish for tonight, one of which includes being with you right this moment. Right now, all I can do is to dream about you and relive the moments that we shared. I know that when we are with each other again, it will be one of the sweetest days ever. I love you so much. Good night, sweetie!",
  "The nights are much sweeter and warmer because of your love. Every day and every night spent with you is truly a blessing. I wouldn’t trade this for anything else in the world. You are the only one my heart beats for, and this is how it’s going to be from here on out. Dream sweet dreams of me tonight, will you? I love you. Good night, my sweetheart.",
  "There’s never a moment that I don’t miss you or think of you. Every time that we’re not together, this is how it’s going to be. This is because your husband just truly loves you and wants to spend every meaningful moment with you. Please forgive me for being so in love with you. Sweet dreams, beautiful. I can’t wait to see you again. Good night.",
  "You are the light of my life. I’m not afraid of the dark because I have your love to hold on to. I no longer fear the unknown because I know that you and I will face it together. I no longer feel alone, even if I’m far away from you because I know that I have you to come home to. Thank you for being in my life, my sweet wife. I love you now and always. Good night and sweet dreams.",
  "I’m looking at the stars right now, and I couldn’t help but be reminded of your beautiful eyes. Your eyes that always sparkle with life, with happiness, and with mischief. No matter what we will face in the future, never lose that sparkle in your eyes, my dear wife. I love you. Time to get to bed now. Good night. Sweet dreams!",
  "I’m just about to finish here at work. It’s been a long and tiring day. But the best part about this is that I’m coming home to you. I can finally rest and fall asleep in your arms. See you in a bit, love. Good night!",
  "I find it hard to concentrate right now because my mind keeps going to that scene earlier this morning when we were having breakfast. The soft sunlight from the windows and your sleepy but clear face looked so beautiful it must have been Photoshopped. I live for mornings like that. I love you! Good night!",
  "Are you ready to sleep? I know you’ve had a busy day. I hope you got something good for dinner to reward yourself. Let me guess, you’re still in the bath, with scented candles, bath salts, and Diana Krall on Spotify? Rest well and sweet dreams, sweetheart. Good night.",
  "Knowing that I have your love and support makes everything better and makes every challenge easier to overcome. I just love knowing that I have an incredible wife that I get to go home to every single day. I’ll be home in a while but don’t wait up for me. Sleep well and good night!",
  "You’re probably in bed now and trying to fall asleep. The time difference is killing me. But I feel a little better knowing that as I go about my day, you are there happily dreaming of me. I miss you and I can’t wait to be with you soon. Good night, my love!",
  "This is me just saying goodnight to the reason why I’m the happiest husband in the world. Every day has so much meaning because you inspire me to be the best version of myself. I love you so much. Good night and sweet dreams!",
  "Every night, I say a little prayer of thanks that I have a wonderful wife who keeps me grounded, focused, motivated, and kind. No challenge is too hard because I know that I have your love and support. Thank you, love. Good night.",
  "Nights seem shorter when I’m with you, and days are longer when I don’t spend it with you. I hope that you had a great day today. I know you’re looking forward to finally climbing to bed and falling into an easy sleep. Don’t wait up for me. I’ll see you in the morning. Good night!",
  "Now I know that long distance relationships are hard. My heart feels heavy every time I wish you good night because I’d rather be holding you in my arms and falling asleep together. But I look forward to the day I’ll come home and be with you again. It won’t be long now, my love! Sleep well and good night!",
  "The best place to fall asleep is right there in your arms. I’m on my way to you now, my love. Rest well and good night. Never forget that I love you.",
  "You are my sunshine, but for now, let the light of the moon lull you to sleep so that you can be in my warm embrace the next morning.",
  "I’m imagining your beautiful eyes reading this while your skin glows brightly in the light of your phone and your hair lies gently against your skin. I wish I was there.",
  "Being with you makes me complete, and when I am near you, I just feel you and nothing else. Good night! See you soon.",
  "Every night I pray to heaven to give me more years so I can have more opportunities to tell you how much I love you. Goodnight, lady of my life!",
  "My one and only – you shine your light in my path and make me know how precious it is to live a life of impact. Love you always. Good night!",
  "I wonder how well you sleep at night and what kind of dreams you have. I wish I could step into your mind as you step into mine. Good night, my beautiful wife.",
  "Sleep well because my love has the wings to cover you and my hug and kiss are the warmth to give you pleasure. Good night, darling.",
  "Leave all your worries aside and close your eyes to sleep. Many thoughts may ponder your mind, but this shall too pass. For the new dawn, wish you a love-filled, dreamy night!",
  "As I lay in bed, as I watch through the window, I see beautiful stars twinkling up in the sky. They make me think of the beautiful star in my life – that’s you, my dear wife. Good night!",
  "Dear wife, I send my heartfelt good night wishes to you. I hope you have a peaceful sleep with dreams of our lovely moments spent together.",
  "The stars and the moon cannot compete with your inner glow. May this bright light inside of you last forever. I will do anything to keep it safe. Have a good night, my love. I’ll see you soon.",
  "In the end, it’s you who fills the emptiness in me – I’m in love with you! Good night and never let your inner shine go.",
  "It does not matter how far you are – you will always be in my heart. Good night, love.",
  "The last person that I remember while going to sleep is the one reading this text. I miss you a lot, my lovely wife. Good night. Have sweet dreams.",
  "There is nothing harder than being away from you. I miss you so much, my love. I cannot wait to be home and see you soon. Good night. Keep shining, like you always do.",
  "Sleeping beside you is important, but the hope that you will be with me until the end of time is what’s paramount. I hope your night is filled with love and splendor. Have a peaceful night, my wife!",
  "It is a beautiful feeling being your husband. Always be mine and keep shining. Love you, my wife!",
  "I just want you to know how much I think of you. Life is just better when your kisses are there. The world is a better place with you around, my sweetheart. Good night, sleep tight!",
  "You make being your partner easy. I admire you so much, and I can’t wait to let you know how I feel at all times. I love you, dear! Good night!",
  "I wish the moon would always be full and bright and you always be calm and right. Whenever you go to switch off the light, remember that I’m wishing you a good night!",
  "Oh my pretty wife, I just want to tell you, sleep tight! I’ll be there in your dreams to be by your side. Miss you – waiting to see you soon!",
  "Beautiful in the morning, pretty at noon, and stunning at night – no wonder I can’t let you out of my sight. Good night, my loving wife.",
  "One day I wish my dream would come true, and I’d wake up next to you. Till then, good night! I love you!",
  "How beautiful it is to end your day when you are rested in the warmth of your wife’s embrace. I love you, my dear wife.Good night. Sleep tight!",
  "May the stars sing you a lullaby of love every night, and may the moon guard your sleep till the end of time! Sleep well, sweetheart!",
  "You make my heart beat like a drum. You truly are one of a kind! Good night!",
  "Our marriage is the best proof that true love exists, and you are the best proof that a perfect wife is not a myth. Good night, my life.",
  "The fact that the same moon lights up our nights is making me feel better when you’re not by my side. I feel like I see these stars through your eyes. I love you and I miss you. Have a good night.",
  "You are the light of my life, you are the sweetest dream I have ever had, you are everything to me, and I never want to be apart from you. Good night, my love.",
  "I don’t know whether it is my destiny or luck that I met you. Or perhaps God has written you for me on the canvas of life. Good night, my dear wife.",
  "The hardest thing in my life is that I don’t get to be with you every moment. I long for that day to come soon. Good night, sweet wife.",
  "Nothing can clearly show how much you mean to me. I’ll let you know how precious you are with this little message tonight. Good night! Sleep tight.",
  "I miss you with every passing second. I miss your warmth, I miss the way everything feels with you by my side. I miss your embrace. Have an amazing night!",
  "I miss going to bed with you at night and waking up by your side. I can’t wait to get home and fall into your arms again. Good night, sleep tight!",
  "I’d walk a thousand miles to be with you tonight. Missing you, my darling. Good night.",
  "Looking at the moon’s radiant shine adorning your beautiful face, all the worries of my life vanish without a trace. I love you, good night.",
  "The night sky of my life just has only one star and that’s YOU. Good night.",
  "The moon can’t shine without night just like I can’t sleep without wishing you a good night. Sleep tight, my love.",
  "You turn heads when you walk through the door, but your eyes only search for me. Lucky to have you as my wife. Good night, my beautiful wife.",
  "Good night, my love. Have pleasant dreams. May tomorrow be sunny and bright and bring you closer to me.",
  "Dearest wife, sending you good night wishes through this message. I hope your love will continue to shine till the end of my life.",
  "The night is too long for you to be away. I am desperately waiting for it to turn into a bright, sunny day. My heart will rot away if things keep going on like this. All I want to do is give you a kiss. Good night.",
  "My name is written on your lips, and my love is written in your heart. Good night.",
  "If you’re having trouble sleeping tonight, just know that I am only a text or a phone call away. Good night! Sleep tight, my dear wife.",
  "You bless my life and make loving you so easy. I love you. As you sleep tonight, remember that someone cherishes you forever.",
  "The message I send you every single night is an open invitation for you to join me in my dream. Good night – we will meet in our dreams.",
  "My dear beautiful wife! You mean the whole world to me. Without you, I can’t imagine my life. Always be mine. Good night.",
  "You better be dreaming of me tonight because I’ll definitely be dreaming of you! Sleep tight, good night!",
  "This text is a drug that drives away nightmares and induces pleasant dreams. The recommended dosage is one love-filled message every night. Good night.",
  "Every night before going to sleep, I think about you, and somehow it makes me feel relaxed and turns my nightmares into lovely dreams. Good night, my dear. I love you!",
  "Your alluring scent is on my pillow, and I can’t stop loving it. Sleep well, my loving wife.",
  "If I close my eyes tight enough, I can feel your gentle touch. You make me feel alive. But for now, good night and sleep tight.",
  "I’m whispering because I don’t want to wake you from a sweet dream. I can sense that you are lost in my dreams and waking you will turn off the whole fantasy. Sweet dreams.",
  "May every star of every night bring joy and happiness into your dreams. Good night.",
  "Distance is just an obstacle that lingers between us, but you’ll always remain in my heart. Good night to you.",
  "In this dark night, you are the only star I see tonight. I wish I was there guarding your dreams tonight.",
  "With you, my nights always glimmer at midnight. Good night, love of my life.",
  "I think of you and smile. The imagination of you fills my heart with an undying love. How do you do it? It’s amazing having you by my side. Love you and good night.",
  "I wish I could be there to hug you tight and shower all my love on you. Good night, my love!",
  "This night is taking forever to end. I am eagerly waiting to see you again, to embrace and hold your hand for the rest of my life. Good night, my dear wife.",
  "Your angelic voice, your gentle touch, and the light in your eyes are everything that makes me what I am today. Your presence is like a love story that I wish never has an end. Good night.",
  "As you enter the dreamland tonight, may you be blessed with the love of your life. Good night to the most beautiful lady of my life.",
  "Romantic hugs, naughty tugs, slow kisses, and endless cuddles are how I want to wish you a good night tonight.",
  "You shine brighter than any star in the sky. You are more brilliant than any diamond from Tiffany’s. You are intelligent, funny, caring, and loving. I hope your dreams are filled with syrupy sweetness and chocolate hearts. Goodnight, my queen.",
  "Sweety, as you go to bed tonight, know that nothing in the world is ever going to change the love I have for you. Good night.",
  "You are the biggest gift of my life. Have a good night’s rest, my dear wife.",
  "Nights without you are the worst. I wish I was with you right now, holding you tight. May this night be peaceful and filled with pretty harmony. Can’t wait to see you, baby. Good night.",
  "The memories that you have given me are worth a million dollars. I hope I can treasure them until my last heartbeat! Good night!",
  "I want to hold you so bad right now. Every night that I spent without you is the coldest night ever. I can’t wait to see you again. May your dreams be full of bright colors and wonderful surprises. Have a sublime night.",
  "You can’t love someone wisely; you can only love someone madly. Sleep tight!",
  "All I do is think about you. There is no doubt in my mind that you complete me. Every little thing you do to make me happy adds up to make me the happiest man in the world. Good night!",
  "God saw a need for an angel in human form and created you. God saw someone who needed you and placed you in my life. I’m just so blessed thinking about you every night. Sleep tight.",
  "Even if circumstances separate us, I know our unshakable bond of love will pull us closer again. Good night, my lovely wife!",
  "The moon is full to the brim simply because it is going to watch you sleep all night. I can’t help being envious. Thank you for everything. Good night.",
  "Last night, I sent an angel to watch οver you while yοu were in a deep sleep. Ηe came back early. I asked him why? Ηe said that angels don’t watch οver another angel.",
  "You brighten my world with your love and fill my night with utmost magnificence. Thank you for your ever-present and sparkling smile. Saying ‘I love you’ is not even close to what I feel for you every night. Good night, my wife.",
  "My love is only for you. My attention is only for you, my queen. That’s why I can’t sleep without sending you a kiss.",
  "I know I cannot be with you, but I want you to know that I’ll be here dreaming about you all night long until we meet next. Good night and sleep tight!",
  "I feel so comfortable with you. If only you were here, I’d feel satisfied too. I love you so much. Good night, my baby love.",
  "Summer, winter, spring, and autumn are all seasons that will come and go, but my love for my queen is eternal. Good night, my wife.",
  "Thinking about you is the tipping point where my nightmares end and sweet dreams begin. I love you and miss you, my wife. Good night.",
  "The stars are the glittery notes in the night sky, twinkling your personal lullaby to say good night!",
  "Forget the things that make you sad; remember the moments that make you glad; forget the troubles that passed away; accept the blessings that come your way. Good night!",
  "The night is silent, night is sweet. The night is calm, night is quiet. But it is not complete without wishing my loving wife a good night.",
  "The silence of the night is the power that brings a new hope to see a new dawn. Good night!",
  "When you came into my life, everything became new. I am so happy for everything that you have added to my life. Good night and have a peaceful night.",
  "The atmosphere your presence brings into my life is amazing. I can’t fathom how one person can touch a life and brighten the world around. You have done so much for me that every time I think about you, my heart skips a beat. I love you, always. Good night.",
  "I wish a good night to the woman of my life and the queen of my heart. Sleep tight and wake up with a big smile!",
  "Just as the sun and moon are destined to rise and shine, I am destined to be with you for the rest of my life. I miss you a lot. Have a nice sleep with beautiful dreams. Good night.",
  "At the end of the day, all I wish to see is your bright smile that makes my day. Hope you had a great one! Good night, my lovely wife."
]